CSI API ETABS v1
cAreaObj.AddByPoint Method
 Adds a new area object whose defining points are specified by name.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AddByPoint(
	int NumberPoints,
	ref string[] Point,
	ref string Name,
	string PropName = "Default",
	string UserName = ""
)
Function AddByPoint (
	NumberPoints As Integer,
	ByRef Point As String(),
	ByRef Name As String,
	Optional PropName As String = "Default",
	Optional UserName As String = ""
) As Integer
Dim instance As cAreaObj
Dim NumberPoints As Integer
Dim Point As String()
Dim Name As String
Dim PropName As String
Dim UserName As String
Dim returnValue As Integer
returnValue = instance.AddByPoint(NumberPoints,
	Point, Name, PropName, UserName)
int AddByPoint(
	int NumberPoints,
	array<String^>^% Point,
	String^% Name,
	String^ PropName = L"Default",
	String^ UserName = L""
)
abstract AddByPoint :
        NumberPoints : int *
        Point : string[] byref *
        Name : string byref *
        ?PropName : string *
        ?UserName : string
(* Defaults:
        let _PropName = defaultArg PropName "Default"
        let _UserName = defaultArg UserName ""
*)
-> int
Parameters
NumberPoints
Type: System.Int32
 The number of points in the area object.
Point
Type: System.String[]
 This is an array containing the names of the point objects that define the added area object. The point object names should be ordered to run clockwise or counter clockwise around the area object.
Name
Type: System.String
 This is the name that the program ultimately assigns to the area object. If no userName is specified, the program assigns a default name to the area object. If a userName is specified and that name is not used for another area object, the userName is assigned to the area object; otherwise a default name is assigned to the area object.
PropName (Optional)
Type: System.String
 This is Default, None or the name of a defined area property.
 If it is Default, the program assigns a default area property to the area object. If it is None, no area property is assigned to the area object. If it is the name of a defined area property, that property is assigned to the area object.
UserName (Optional)
Type: System.String
Return Value
Type: Int32
 Returns zero if the area object is successfully added; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Point() As String
   Dim Name As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add area object by points
   Redim Point(3)
   Point(0) = "8"
   Point(1) = "2"
   Point(2) = "65"
   Point(3) = "68"
   ret = SapModel.AreaObj.AddByPoint(4, Point, Name)
'refresh view
   ret = SapModel.View.RefreshView(0, False)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace